[{"id_formation":"1","nom_formation":"html","contenu":"Ça y est, vous avez installé tous les logiciels ? Vous devriez maintenant avoir un éditeur de texte pour créer votre site (comme Sublime Text) et plusieurs navigateurs pour le tester (Mozilla Firefox, Google Chrome…).\r\n\r\nDans ce chapitre, nous allons commencer à pratiquer ! Nous allons découvrir les bases du langage HTML et enregistrer notre toute première page web ! \r\nAlors oui, bien sûr, ne vous attendez pas encore à réaliser une page web exceptionnelle dès ce second chapitre, mais patience… cela viendra !\r\n\r\nCréer une page web avec l'éditeur\r\nAllez, mettons-nous en situation ! Comme je vous l'ai dit, nous allons créer notre site dans un éditeur de texte. Vous avez dû en installer un suite à mes conseils dans le premier chapitre : qu'il s'appelle Sublime Text, Notepad++, Brackets, jEdit, vim, TextWrangler… peu importe. Ces logiciels ont un but très simple : vous permettre d'écrire du texte !\r\n\r\nDans la suite de ce cours, je travaillerai avec Sublime Text. Je vais donc l'ouvrir :","dure_formation":"3","date_formation":"2017-06-01 09:10:00","lieux":"Paris","pre_requis":"pas de pre-requis ","prix_formation":"300"},{"id_formation":"2","nom_formation":"css","contenu":"près avoir passé toute une première partie du cours à ne travailler que sur le HTML, nous allons maintenant découvrir le CSS que j'avais volontairement mis à l'écart. Le CSS n'est pas plus compliqué que le HTML. Il vient le compléter pour vous aider à mettre en forme votre page web.\r\n\r\nDans ce premier chapitre sur le CSS, nous allons voir la théorie sur le CSS : qu'est-ce que c'est ? À quoi cela ressemble-t-il ? Où est-ce qu'on écrit du code CSS ? Ces aspects théoriques ne sont pas bien compliqués mais vous devez obligatoirement les connaître car c'est la base du CSS. C'est d'ailleurs la seule chose que je vous demanderai de retenir par cœur en CSS, vous pourrez retrouver le reste dans le mémo en annexe.\r\n\r\nAllez, ne traînons pas, je vois que vous brûlez d'impatience !\r\n\r\nLa petite histoire du CSS\r\nJe vous avais avertis dès le début de ce cours : nous allons apprendre deux langages. Nous avons déjà bien entamé notre découverte du HTML, même s'il reste encore de nombreuses choses à apprendre (nous y reviendrons dans quelques chapitres). En revanche, il est temps maintenant de nous intéresser au CSS.\r\n\r\nCSS (Cascading Style Sheets), c'est cet autre langage qui vient compléter le HTML.\r\nVous vous souvenez de son rôle ? Gérer la mise en forme de votre site.\r\n\r\nPetit rappel : à quoi sert CSS ?\r\n\r\nCSS ? C'est lui qui vous permet de choisir la couleur de votre texte.\r\nLui qui vous permet de sélectionner la police utilisée sur votre site.\r\nLui encore qui permet de définir la taille du texte, les bordures, le fond…\r\n\r\nEt aussi, c'est lui qui permet de faire la mise en page de votre site. Vous pourrez dire : je veux que mon menu soit à gauche et occupe telle largeur, que l'en-tête de mon site soit calé en haut et qu'il soit toujours visible, etc.","dure_formation":"2","date_formation":"2017-06-05 08:30:00","lieux":"Paris","pre_requis":"HTML","prix_formation":"200"},{"id_formation":"3","nom_formation":"PHP","contenu":"1.1 Définition\r\nPHP est un langage de script HTML exécuté du côté du serveur. Il veut dire « PHP : Hypertext\r\nPreprocessor ». Sa syntaxe est largement inspirée du langage C, de Java et de Perl, avec des\r\naméliorations spécifiques. Le but du langage est d'écrire rapidement des pages HTML dynamiques.\r\n1.2 Historique\r\nL'origine de PHP remonte à 1995 quand Rasmus Lerdorf a créé PHP\/FI, une librairie de scripts Perl\r\nutilisés pour la publication de son CV sur son site personnel. Au fur et à mesure des évolutions, la\r\nlibrairie a été portée en C et agrémentée de nouvelles fonctionnalités pour créer des pages\r\ndynamiques simples pour le web et accéder à quelques sources de données. PHP\/FI signifie\r\nPersonal Home Page\/Forms Interpreter.\r\nPHP\/FI 2.0 sort en 1997, toujours développé par une seule personne. C'est le succès : 50000 sites\r\n(1% des noms de domaines) disent l'utiliser ou le supporter. Les contributeurs affluent.\r\nPHP 3.0 sort en juin 1998, c'est la première version développée conjointement par Rasmus Lerdorf,\r\nAndi Gutmans et Zeev Suraski et entièrement réécrite (les versions précédentes étaient trop lentes\r\npour une application commerciale). Outre les performances, PHP 3 est modulaire et extensible,\r\npermettant de lui greffer des API supplémentaires, ce qui n'a pas manqué avec le support de\r\nnombreuses bases de données, de formats et de protocoles, une syntaxe plus cohérente et un support\r\nbasique de l'objet. Il a été installé sur 10% du parc mondial des serveurs web avec des dizaines de\r\nmilliers de développeurs et des centaines de milliers de sites.","dure_formation":"5","date_formation":"2017-06-10 09:20:00","lieux":"Paris","pre_requis":"HTML et Css","prix_formation":"500"},{"id_formation":"4","nom_formation":"Marketing Digital","contenu":"Bienvenue à toutes et à tous !\n\n?Est-ce que vous vous êtes déjà demandé comment :\n\nfaire connaître une marque ?\nattirer plus de visiteurs sur un site ?\nmieux convertir des prospects en clients ?\net comment en faire des ambassadeur par la suite?\nAlors le marketing digital devrait vous intéresser ! ??\n\nJe suis ravi de partager avec vous ma passion pour le marketing digital. Si vous savez déjà plus ou moins en quoi consiste la publicité en ligne, le référencement, l’emailing ou encore le community management, vous connaissez quelques-unes des nombreuses branches du marketing digital – mais il y en a tellement que vous vous demandez peut-être par où commencer ! Ou bien, si vous débutez, peut-être que le terme “marketing digital” n’est pas encore clair pour vous : ne vous inquiétez pas ! Dans ce cours d’initiation, c'est de zéro qu'on va recommencer. Et c’est progressivement que je vous familiariserai avec les méthodes fondamentales et les techniques incontournables de ce domaine passionnant.\n\nÀ la fin de la première partie de ce cours, vous serez vous-même capable d’expliquer à un débutant en quoi ça consiste. \nDans la deuxième partie de ce cours, vous apprendrez à élaborer une stratégie web marketing actionnable et à l'intégrer dans le livrable par excellence du marketer : le plan marketing.\nEnfin, dans la troisième partie, une fois que vous maîtriserez les bases, je vous montrerai comment améliorer la performance de vos actions web marketing à chaque niveau de la relation client.\nJe suis convaincu qu'avant la fin de ce cours, vous aurez les connaissances et les compétences nécessaires pour bien commencer dans le marketing digital. J’ai tout fait pour le rendre aussi intéressant et complet que possible ; alors que vous soyez un véritable débutant ou non, n’hésitez plus : suivez ce cours dès maintenant !","dure_formation":"2","date_formation":"2017-06-16 10:20:00","lieux":"Paris","pre_requis":"Rien","prix_formation":"300"},{"id_formation":"5","nom_formation":"Web marketing","contenu":"\r\nIntroduction du cours\r\nS’adapter aux changements engendrés par la transformation digitale c’est d’abord changer de comportement.\r\n\r\nDans ce cours, vous découvrirez la notion de “posture d’ouverture” notion essentielle dans la vie quotidienne ou dans le monde de l’entreprise d’aujourd’hui. \r\nComment innover, comment prendre des risques ou faire confiance aux autres ? Ces trois interviews répondront à ces questions !","dure_formation":"1","date_formation":"2017-06-24 14:00:00","lieux":"Paris","pre_requis":"rein","prix_formation":"600"},{"id_formation":"6","nom_formation":"js","contenu":"test E4","dure_formation":"3","date_formation":"2017-07-01 08:30:00","lieux":"paris","pre_requis":"html\/css","prix_formation":"2000"},{"id_formation":"7","nom_formation":"Comprendre le web","contenu":"Le web est une toile araignée qui relie plus ordinateur entre eux.","dure_formation":"1","date_formation":"2017-02-27 08:00:00","lieux":"Paris","pre_requis":"rien","prix_formation":"100"}]